## Pandas Primer 6
------------

In [1]:
import pandas as pd
import numpy as np
import datetime as dt
import seaborn as sns; sns.set()
import math
import zmq
import statsmodels.api as sm
import matplotlib.pyplot as plt
import quandl as ql
ql.ApiConfig.api_key= "9Djob1GoNyL-pEK4-vEk"

## Joining, Appending, Merging

In [2]:
#Let us start with two small sample DataFrame objects (I).
df1 = pd.DataFrame(['100', '200', '300', '400'], 
                   index=['a', 'b', 'c', 'd'], columns=['A',])
df1

     A
a  100
b  200
c  300
d  400

#### Let us start with two small sample DataFrame objects (II).

In [3]:
df2 = pd.DataFrame(['200', '150', '50'], 
                   index=['f', 'b', 'd'], columns=['B',])
df2

     B
f  200
b  150
d   50

#### Default operations (I).
<a id ='cell73'></a>

In [4]:
df1.append(df2)

     A    B
a  100  NaN
b  200  NaN
c  300  NaN
d  400  NaN
f  NaN  200
b  NaN  150
d  NaN   50

#### Default operations (II).

In [5]:
df1.append(df2, ignore_index=True)

     A    B
0  100  NaN
1  200  NaN
2  300  NaN
3  400  NaN
4  NaN  200
5  NaN  150
6  NaN   50

#### Default operations (III).
<a id='cell74'></a>

In [6]:
pd.concat((df1, df2))

     A    B
a  100  NaN
b  200  NaN
c  300  NaN
d  400  NaN
f  NaN  200
b  NaN  150
d  NaN   50

#### Default operations (IV).

In [7]:
pd.concat((df1, df2), ignore_index=True)

     A    B
0  100  NaN
1  200  NaN
2  300  NaN
3  400  NaN
4  NaN  200
5  NaN  150
6  NaN   50

#### Default operations (V).
<a id='cell75'></a>

In [8]:
df1.join(df2)

     A    B
a  100  NaN
b  200  150
c  300  NaN
d  400   50

#### Default operations (VI).

In [9]:
df2.join(df1)

     B    A
f  200  NaN
b  150  200
d   50  400

#### Default operations (VII).

In [10]:
df = pd.DataFrame() 
df['A'] = df1['A'] 
df

     A
a  100
b  200
c  300
d  400

In [11]:
df['B'] = df2['B'] # sequence counts 
df

     A    B
a  100  NaN
b  200  150
c  300  NaN
d  400   50

#### Default operations (VIII).

In [12]:
df = pd.DataFrame({'A': df1['A'], 'B': df2['B']}) 
df

     A    B
a  100  NaN
b  200  150
c  300  NaN
d  400   50
f  NaN  200

#### Variants of joining data (I).

In [13]:
df1.join(df2, how='left') # default

     A    B
a  100  NaN
b  200  150
c  300  NaN
d  400   50

#### Variants of joining data (II).

In [14]:
df1.join(df2, how='right')

     A    B
f  NaN  200
b  200  150
d  400   50

#### Variants of joining data (III).

In [15]:
df1.join(df2, how='inner')

     A    B
b  200  150
d  400   50

#### Variants of joining data (IV).

In [16]:
df1.join(df2, how='outer')

     A    B
a  100  NaN
b  200  150
c  300  NaN
d  400   50
f  NaN  200

#### Variants of joining data (V).

In [17]:
df1.join(df2, how='outer', sort=True)

     A    B
a  100  NaN
b  200  150
c  300  NaN
d  400   50
f  NaN  200